ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_НачислениеЗарплаты/ВКМ_НачислениеЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачислениеЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <attributes>
    <name>ВКМ_МесяцНачисления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <schedule>InformationRegister.ВКМ_КалендарьРабочихДней</schedule>
  <scheduleValue>InformationRegister.ВКМ_КалендарьРабочихДней.Resource.ВКМ_Коэффициент</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_КалендарьРабочихДней.Dimension.ВКМ_Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>ВКМ_ПерерасчетОсновныхНачислений</name>
  </recalculations>
</mdclass:CalculationRegister>

ConfigurationFonecmidDiplomTuzeka/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>ВКМ_Результат</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
    <baseDimension>true</baseDimension>
  </dimensions>
  <recalculations>
    <name>ВКМ_ПерерасчетУдержаний</name>
  </recalculations>
</mdclass:CalculationRegister>

ConfigurationFonecmidDiplomTuzeka/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ConfigurationFonecmidDiplomTuzeka/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ВКМ_Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_ПроцентОтРабот</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ConfigurationFonecmidDiplomTuzeka/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_ЧасовКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ConfigurationFonecmidDiplomTuzeka/src/Enums/ВКМ_КатегорииСотрудников/ВКМ_КатегорииСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВКМ_КатегорииСотрудников</name>
  <enumValues>
    <name>ВКМ_Специалист</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АдминистративныйПерсонал</name>
  </enumValues>
</mdclass:Enum>

ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <predefined>
    <items>
      <name>ВКМ_Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>ВКМ_Отпускные</name>
      <description>Отпускные</description>
    </items>
    <items>
      <name>ВКМ_ПроцентОтРабот</name>
      <description>Процент от работ</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_НачислениеЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	НачалоПериода = НачалоМесяца(ВКМ_МесяцНачисления);
	КонецПериода = КонецМесяца(ВКМ_МесяцНачисления);
	РабочихДнейМесяца = ВКМ_ПроизводственныйКалендарь.ВКМ_КоличествоРабочихДней(НачалоПериода, КонецПериода);
	СтавкаНДФЛ = 0.13;

	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
	Движения.ВКМ_Удержания.Записывать = Истина;
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.ВКМ_Категория КАК Категория
	|ИЗ
	|	Справочник.ВКМ_Сотрудники КАК Сотрудники
	|ГДЕ
	|	НЕ Сотрудники.ПометкаУдаления";
	ВыборкаСотрудников = Запрос.Выполнить().Выбрать();

	ДанныеОбОтпускахСотрудников = СформироватьДанныеОбОтпускахСотрудников(НачалоПериода, КонецПериода);
	СреднийЗаработокСотрудников = СформироватьСреднийЗаработокСотрудников(НачалоПериода);

	Пока ВыборкаСотрудников.Следующий() Цикл

		УсловияОплаты = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
			КонецПериода,
			Новый Структура("ВКМ_Сотрудник", ВыборкаСотрудников.Сотрудник));

		Если УсловияОплаты.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;

		БазаНДФЛ = 0;
		РабочихДнейОтпуска = 0;

		ДанныеОтпуска = ДанныеОбОтпускахСотрудников.Получить(ВыборкаСотрудников.Сотрудник);
		Если ДанныеОтпуска = Неопределено Тогда
			ДанныеОтпуска = Новый Структура;
			ДанныеОтпуска.Вставить("ЕстьОтпуск", Ложь);
			ДанныеОтпуска.Вставить("КалендарныхДней", 0);
			ДанныеОтпуска.Вставить("РабочихДней", 0);
			ДанныеОтпуска.Вставить("ДатаНачала", Неопределено);
			ДанныеОтпуска.Вставить("ДатаОкончания", Неопределено);
		КонецЕсли;

		Если ДанныеОтпуска.ЕстьОтпуск Тогда

			СреднедневнойЗаработок = СреднийЗаработокСотрудников.Получить(ВыборкаСотрудников.Сотрудник);
			Если СреднедневнойЗаработок = Неопределено Тогда
				СреднедневнойЗаработок = 0;
			КонецЕсли;
			РабочихДнейОтпуска = ДанныеОтпуска.РабочихДней;

			ДвижениеОтпускные = Движения.ВКМ_ОсновныеНачисления.Добавить();
			ДвижениеОтпускные.ПериодРегистрации = НачалоПериода;
			ДвижениеОтпускные.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Отпускные");
			ДвижениеОтпускные.ВКМ_Сотрудник = ВыборкаСотрудников.Сотрудник;
			ДвижениеОтпускные.ПериодДействияНачало = ДанныеОтпуска.ДатаНачала;
			ДвижениеОтпускные.ПериодДействияКонец = ДанныеОтпуска.ДатаОкончания;
			ДвижениеОтпускные.ВКМ_Результат = СреднедневнойЗаработок * ДанныеОтпуска.КалендарныхДней;

			БазаНДФЛ = БазаНДФЛ + ДвижениеОтпускные.ВКМ_Результат;

		КонецЕсли;

		ДвижениеОклад = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ДвижениеОклад.ПериодРегистрации = НачалоПериода;
		ДвижениеОклад.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_Оклад");
		ДвижениеОклад.ВКМ_Сотрудник = ВыборкаСотрудников.Сотрудник;
		ДвижениеОклад.ПериодДействияНачало = НачалоПериода;
		ДвижениеОклад.ПериодДействияКонец = КонецПериода;
		Если РабочихДнейМесяца > 0 Тогда
			ДвижениеОклад.ВКМ_Результат =
				УсловияОплаты[0].ВКМ_Оклад * (РабочихДнейМесяца - РабочихДнейОтпуска) / РабочихДнейМесяца;
		Иначе
			ДвижениеОклад.ВКМ_Результат = УсловияОплаты[0].ВКМ_Оклад;
		КонецЕсли;

		БазаНДФЛ = БазаНДФЛ + ДвижениеОклад.ВКМ_Результат;

		Если ВыборкаСотрудников.Категория =
			ПредопределенноеЗначение("Перечисление.ВКМ_КатегорииСотрудников.ВКМ_Специалист") Тогда

			ОтборПоСотруднику = Новый Структура("ВКМ_Сотрудник", ВыборкаСотрудников.Сотрудник);
			ОборотыРабот = РегистрыНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(
				НачалоПериода, КонецПериода, ОтборПоСотруднику);

			Если ОборотыРабот.Количество() > 0 Тогда
				ДвижениеПроцент = Движения.ВКМ_ОсновныеНачисления.Добавить();
				ДвижениеПроцент.ПериодРегистрации = НачалоПериода;
				ДвижениеПроцент.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_ОсновныеНачисления.ВКМ_ПроцентОтРабот");
				ДвижениеПроцент.ВКМ_Сотрудник = ВыборкаСотрудников.Сотрудник;
				ДвижениеПроцент.ВКМ_Результат = ОборотыРабот[0].ВКМ_СуммаКОплате;

				БазаНДФЛ = БазаНДФЛ + ДвижениеПроцент.ВКМ_Результат;
			КонецЕсли;

		КонецЕсли;

		ДвижениеНДФЛ = Движения.ВКМ_Удержания.Добавить();
		ДвижениеНДФЛ.ПериодРегистрации = НачалоПериода;
		ДвижениеНДФЛ.ВидРасчета = ПредопределенноеЗначение("ПланВидовРасчета.ВКМ_Удержания.ВКМ_НДФЛ");
		ДвижениеНДФЛ.ВКМ_Сотрудник = ВыборкаСотрудников.Сотрудник;
		ДвижениеНДФЛ.ВКМ_Результат = БазаНДФЛ * СтавкаНДФЛ;

		ДвижениеВзаиморасчеты = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		ДвижениеВзаиморасчеты.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеВзаиморасчеты.Период = НачалоПериода;
		ДвижениеВзаиморасчеты.ВКМ_Сотрудник = ВыборкаСотрудников.Сотрудник;
		ДвижениеВзаиморасчеты.ВКМ_Сумма = БазаНДФЛ - ДвижениеНДФЛ.ВКМ_Результат;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьДанныеОбОтпускахСотрудников(НачалоПериода, КонецПериода)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Отпуска.ВКМ_Сотрудник КАК Сотрудник,
	|	Отпуска.ВКМ_ДатаНачала КАК ДатаНачала,
	|	Отпуска.ВКМ_ДатаОкончания КАК ДатаОкончания
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ВКМ_ОтпускаСотрудников КАК Отпуска
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВКМ_ГрафикОтпусков КАК ГрафикОтпусков
	|		ПО Отпуска.Ссылка = ГрафикОтпусков.Ссылка
	|ГДЕ
	|	ГрафикОтпусков.Проведен
	|	И Отпуска.ВКМ_ДатаНачала <= &КонецПериода
	|	И Отпуска.ВКМ_ДатаОкончания >= &НачалоПериода";
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);

	ДанныеПоСотрудникам = Новый Соответствие;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		ДанныеОтпуска = ДанныеПоСотрудникам.Получить(Выборка.Сотрудник);
		Если ДанныеОтпуска = Неопределено Тогда
			ДанныеОтпуска = Новый Структура;
			ДанныеОтпуска.Вставить("ЕстьОтпуск", Ложь);
			ДанныеОтпуска.Вставить("КалендарныхДней", 0);
			ДанныеОтпуска.Вставить("РабочихДней", 0);
			ДанныеОтпуска.Вставить("ДатаНачала", Неопределено);
			ДанныеОтпуска.Вставить("ДатаОкончания", Неопределено);
			ДанныеПоСотрудникам.Вставить(Выборка.Сотрудник, ДанныеОтпуска);
		КонецЕсли;

		ИнтерсекцияНачало = ?(Выборка.ДатаНачала > НачалоПериода, Выборка.ДатаНачала, НачалоПериода);
		ИнтерсекцияКонец = ?(Выборка.ДатаОкончания < КонецПериода, Выборка.ДатаОкончания, КонецПериода);

		ДанныеОтпуска.ЕстьОтпуск = Истина;
		ДанныеОтпуска.КалендарныхДней = ДанныеОтпуска.КалендарныхДней
			+ ВКМ_ПроизводственныйКалендарь.ВКМ_КоличествоКалендарныхДней(ИнтерсекцияНачало, ИнтерсекцияКонец);
		ДанныеОтпуска.РабочихДней = ДанныеОтпуска.РабочихДней
			+ ВКМ_ПроизводственныйКалендарь.ВКМ_КоличествоРабочихДней(ИнтерсекцияНачало, ИнтерсекцияКонец);

		Если ДанныеОтпуска.ДатаНачала = Неопределено Или ИнтерсекцияНачало < ДанныеОтпуска.ДатаНачала Тогда
			ДанныеОтпуска.ДатаНачала = ИнтерсекцияНачало;
		КонецЕсли;
		Если ДанныеОтпуска.ДатаОкончания = Неопределено Или ИнтерсекцияКонец > ДанныеОтпуска.ДатаОкончания Тогда
			ДанныеОтпуска.ДатаОкончания = ИнтерсекцияКонец;
		КонецЕсли;

	КонецЦикла;

	Возврат ДанныеПоСотрудникам;

КонецФункции

Функция СформироватьСреднийЗаработокСотрудников(НачалоПериода)

	КонецОкна = НачалоПериода - 1;
	НачалоОкна = НачалоМесяца(КонецОкна);
	Для Индекс = 1 По 11 Цикл
		НачалоОкна = НачалоМесяца(НачалоОкна - 1);
	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОсновныеНачисления.ВКМ_Сотрудник КАК Сотрудник,
	|	СУММА(ОсновныеНачисления.ВКМ_Результат) КАК Сумма
	|ИЗ
	|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ОсновныеНачисления
	|ГДЕ
	|	ОсновныеНачисления.ПериодРегистрации МЕЖДУ &НачалоОкна И &КонецОкна
	|
	|СГРУППИРОВАТЬ ПО
	|	ОсновныеНачисления.ВКМ_Сотрудник";
	Запрос.УстановитьПараметр("НачалоОкна", НачалоОкна);
	Запрос.УстановитьПараметр("КонецОкна", КонецОкна);

	РабочихДнейОкна = ВКМ_ПроизводственныйКалендарь.ВКМ_КоличествоРабочихДней(НачалоОкна, КонецОкна);

	СреднийЗаработокПоСотрудникам = Новый Соответствие;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если РабочихДнейОкна > 0 Тогда
			СреднийЗаработокПоСотрудникам.Вставить(Выборка.Сотрудник, Выборка.Сумма / РабочихДнейОкна);
		Иначе
			СреднийЗаработокПоСотрудникам.Вставить(Выборка.Сотрудник, 0);
		КонецЕсли;
	КонецЦикла;

	Возврат СреднийЗаработокПоСотрудникам;

КонецФункции

#КонецОбласти

#КонецЕсли
